
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALTAS.
       AUTHOR. ZU¥IGA.
       DATE-WRITTEN. 23-08-2000.
       DATE-COMPILED. 23-08-2000.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. HP.
       OBJECT-COMPUTER. HP.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT PUESTOS ASSIGN TO RANDOM "PUESTOS".

       DATA DIVISION.
       FILE SECTION.
       FD PUESTOS LABEL RECORD IS STANDAR.
       01 REGISTRO.
	   03 NOMBRE PIC X(30).
	   03 DEPT   PIC X(20).
	   03 SUEL   PIC 99999.

       WORKING-STORAGE SECTION.
       01 ALTA.
	   03 OPCION PIC X.

       01 NUMERICAS.
	   03 CONTADOR PIC 99.
	   03 COND PIC 9.
	   03 COND1 PIC 9.
       01 W-REGISTRO.
	   03 W-NOM PIC X(30).
	   03 W-DEP PIC X(20).
	   03 W-SUE PIC 99999.
       01 VARS.
	   03 CON PIC 99.
	   03 C PIC 99.
       PROCEDURE DIVISION.
       000-RUT-INICIO.
	   PERFORM 050-MARCOS
	   PERFORM 100-INICIO
	   PERFORM 200-PROCESO UNTIL OPCION="N" OR "n"
	   CLOSE PUESTOS.
	   STOP RUN.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING C FROM 1 BY 1 UNTIL C>24.
	   MOVE ZEROS TO VARS.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING C FROM 1 BY 1 UNTIL C>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE C COL 1.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE C COL 78.

       100-INICIO.
	   MOVE ZEROS TO NUMERICAS
	   MOVE SPACES TO ALTA W-REGISTRO
	   OPEN EXTEND PUESTOS

	   DISPLAY "ALTAS DE PERSONAL" AT 0331
	   DISPLAY "NOMBRE DEL EMPLEADO: " AT 0710
	   DISPLAY "DEPARTAMENTO: " AT 1010
	   DISPLAY "SUELDO DEL EMPLEADO: " AT 1310.

       200-PROCESO.
	   DISPLAY "                              " AT 0731
	   DISPLAY "                    " AT 1024
	   DISPLAY "     " AT 1331
	   MOVE ZEROS TO NUMERICAS
	   MOVE SPACES TO ALTA W-REGISTRO
	   ACCEPT W-NOM AT 0731
	   IF W-NOM=SPACES THEN
	     DISPLAY "INTRODUCE UN CARACTER DIFERENTE A ESPACIO"AT 1710
	   ELSE
	      MOVE W-NOM TO NOMBRE
	      PERFORM 210-DEPTO UNTIL COND1=1
	      MOVE ZEROS TO COND1
	      PERFORM 220-SUELDO UNTIL COND1=1
	      PERFORM 230-ESCRIBE
	      DISPLAY "EL REGISTRO FUE DADO DE ALTA"
	      AT 1910
	   END-IF
	   DISPLAY "¨DESEA DAR DE ALTA OTRO EMPLEADO? S/N:  " AT 2110
	   ACCEPT OPCION AT 2150
	      DISPLAY "                            "AT 1910
	     DISPLAY "                                         "AT 1710.

       210-DEPTO.
	   ACCEPT W-DEP AT 1024
	   IF W-DEP=SPACES
	     DISPLAY "INTRODUCE UN CARACTER DIFERENTE A ESPACIO"AT 1710
	   ELSE
	      MOVE 1 TO COND1
	   END-IF.

       220-SUELDO.
	   ACCEPT W-SUE AT 1331 WITH SIZE 5 RIGHT-JUSTIFY
	   IF W-SUE=ZEROS
	     DISPLAY "INTRODUCE UN CARACTER DIFERENTE A ESPACIO"AT 1710
	   ELSE
	      MOVE 1 TO COND1
	   END-IF.

       230-ESCRIBE.
	   WRITE REGISTRO FROM W-REGISTRO
	   INVALID KEY DISPLAY "HASTA PRONTO" AT 2315.
