
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALTASPR.
       AUTHOR. AXA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
	   SELECT PROD ASSIGN TO "PROD.DAT"
	   ORGANIZATION IS INDEXED
	   ACCESS MODE IS RANDOM
	   RECORD KEY IS CLAVE.
       DATA DIVISION.
       FILE SECTION.
       FD PROD.
       01 REG-PROD.
	   02 CLAVE PIC X(9).
	   02 PRODUCTO PIC X(24).
	   02 PRECIO PIC Z(4)V99.
	   02 EXIST PIC Z(3).
	   02 PASILLO PIC Z(2).
	   02 ESTANTE PIC Z(3).
       WORKING-STORAGE SECTION.
       01 RESP PIC X.
       COPY "C:\MATUTINO\QUINTO\506\LABCOBOL\PANTCREA.WKS".
       SCREEN SECTION.
       COPY "C:\MATUTINO\QUINTO\506\LABCOBOL\PANTCREA.SS".
       PROCEDURE DIVISION.
       00-INICIO.
	   PERFORM 01-ABRE
	   PERFORM 02-LIMPIAR
	   PERFORM 03-PROCESO UNTIL RESP= "N" OR  "n"
	   PERFORM 04-CIERRA
	   STOP RUN.
       01-ABRE.
	   OPEN I-O PROD.
       02-LIMPIAR.
	   MOVE SPACES TO CLAVE-W
	   MOVE SPACES TO PRODUCTO-W
	   MOVE ZEROS TO PRECIO-W
	   MOVE ZEROS TO EXIST-W
	   MOVE ZEROS TO PASILLO-W
	   MOVE ZEROS TO ESTANTE-W.

       03-PROCESO.
	   DISPLAY G-PANTCREA
	   ACCEPT LINCLAVE
	   ACCEPT LINPRODUCTO
	   ACCEPT LINPRECIO
	   ACCEPT LINEXIST
	   ACCEPT LINPASILLO
	   ACCEPT LINESTANTE
	   MOVE CLAVE-W TO CLAVE
	   MOVE PRODUCTO-W TO PRODUCTO
	   MOVE PRECIO-W TO PRECIO
	   MOVE EXIST-W TO EXIST
	   MOVE PASILLO-W TO PASILLO
	   MOVE ESTANTE-W TO ESTANTE
	   WRITE REG-PROD
	   DISPLAY "¨DESEA SEGUIR INGRESANDO DATOS S/N?" AT 2525
	   ACCEPT RESP AT 2562.
       04-CIERRA.
	   CLOSE PROD.
