       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALTERNAS.
       AUTHOR. ulises.
       DATE-WRITTEN. 02-10-2000.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. HP.
       OBJECT-COMPUTER. HP.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	    SELECT alterno ASSIGN TO random "alterno"
	    ACCESS MODE IS dynamic
	    ORGANIZATION IS indexed
	    ALTERNATE RECORD KEY IS NOMBRE
	    RECORD KEY IS RFC.

       DATA DIVISION.
       FILE SECTION.
       FD ALTERNO.
       01 REGISTRO.
	    03 RFC	PIC   X(10).
	    03 NOMBRE	PIC   X(30).
	    03 SUELDO	PIC   9(07).
       WORKING-STORAGE SECTION.
       01 OPC PIC X VALUE SPACES.
       01 FFIN PIC X VALUE SPACES.
       PROCEDURE DIVISION.
       000-RUT-INICIO.
	    PERFORM 100-INICIO.
	    PERFORM PROCESO UNTIL OPC = "n" OR "N"
	    MOVE SPACES TO OPC
	    PERFORM PROCESO2 UNTIL OPC ="n" OR "N"
	    CLOSE ALTERNO
	    STOP RUN.

       100-INICIO.
	    OPEN OUTPUT ALTERNO.
	    CLOSE ALTERNO
	    OPEN I-O ALTERNO.
       PROCESO.
	    DISPLAY "TECLEA EL RFC "
	    ACCEPT RFC
	    DISPLAY "NOMBRE "
	    ACCEPT NOMBRE
	    DISPLAY "SUELDO "
	    ACCEPT SUELDO
	    WRITE REGISTRO
	    DISPLAY "MAS ALTAS "
	    ACCEPT OPC
	    DISPLAY ERASE.

       PROCESO2.
	    DISPLAY "NOMBRE "
	    ACCEPT NOMBRE
	    READ ALTERNO INVALID KEY MOVE "S" TO FFIN.
	    IF FFIN = "S"
		DISPLAY "EL REGISTRO NO EXISTE"
		MOVE SPACES TO FFIN
	    ELSE
		DISPLAY RFC
		DISPLAY SUELDO.
	    DISPLAY "MAS CONSULTAS "
	    ACCEPT OPC
