      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.AREASEVA.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMS.
	   03 VARE1 PIC ZZZ.ZZ.
	   03 VARE2 PIC ZZZ.ZZ.
	   03 RESE PIC ZZZZ.ZZ.
       01 VARS.
	   03 VAR1 PIC 999V99 VALUE ZEROS.
	   03 VAR2 PIC 999V99 VALUE ZEROS.
	   03 RES PIC 9999V99 VALUE ZEROS.
	   03 OPC1 PIC 9 VALUE ZEROS.
       01 VARES.
	   03 CON PIC 99.
	   03 C PIC 99.
       01 OPCS.
	   03 OPC2 PIC X.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-PROCESO UNTIL OPC2="N" OR "n"
	   STOP RUN.

       100-PROCESO.
	   PERFORM 050-MARCOS.
	   DISPLAY "MENU DE OPCIONES" AT 0510.
	   DISPLAY "1.CIRCULO" AT 0710.
	   DISPLAY "2.CUADRADO" AT 0910.
	   DISPLAY "3.RECTANGULO" AT 1110.
	   DISPLAY "4.TRIANGULO" AT 1310.
	   DISPLAY "ELIJA SU OPCION:" AT 1510.
	   ACCEPT OPC1 AT 1710.
	   EVALUATE OPC1
	   WHEN 1
	     DISPLAY "DAME EL RADIO" AT 0545
	     ACCEPT VARE1 AT 0745
	     PERFORM 050-MOVER1
	     COMPUTE RES=VAR1*3.14
	     PERFORM 075-MOVER2
	     DISPLAY "EL AREA ES:" AT 0945
	     DISPLAY RESE AT 1145
	   WHEN 2
	     DISPLAY "DAME EL LADO" AT 0545
	     ACCEPT VARE1 AT 0745
	     PERFORM 050-MOVER1
	     COMPUTE RES=VAR1*VAR1
	     PERFORM 075-MOVER2
	     DISPLAY "EL AREA ES:" AT 0945
	     DISPLAY RESE AT 1145
	   WHEN 3
	     DISPLAY "DAME LA BASE" AT 0545
	     ACCEPT VARE1 AT 0745
	     DISPLAY "DAME LA ALTURA" AT 0945
	     ACCEPT VARE2 AT 1145
	     PERFORM 050-MOVER1
	     COMPUTE RES=VAR1 * VAR2
	     PERFORM 075-MOVER2
	     DISPLAY "EL AREA ES" AT 1345
	     DISPLAY RESE AT 1545
	   WHEN 4
	     DISPLAY "DAME LA BASE" AT 0545
	     ACCEPT VARE1 AT 0745
	     DISPLAY "DAME LA ALTURA" AT 0945
	     ACCEPT VARE2 AT 1145
	     PERFORM 050-MOVER1
	     COMPUTE RES=(VAR1 * VAR2)/2
	     PERFORM 075-MOVER2
	     DISPLAY "EL AREA ES" AT 1345
	     DISPLAY RESE AT 1545
	   WHEN OTHER
	     DISPLAY "ERROR VERIFIQUE SU OPCION" AT 0530
	   END-EVALUATE
	   DISPLAY "¨DESEA HACER OTRA OPERACION? S/N" AT 2205.
	   ACCEPT OPC2 AT 2305.
	   MOVE ZEROS TO VARS.

	   050-MOVER1.
	     MOVE VARE1 TO VAR1.
	     MOVE VARE2 TO VAR2.
	   075-MOVER2.
	     MOVE RES TO RESE.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING C FROM 1 BY 1 UNTIL C>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING C FROM 1 BY 1 UNTIL C>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE C COL 1.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE C COL 78.
