       IDENTIFICATION DIVISION.
       PROGRAM-ID.BAJAS.
       AUTHOR. ZU¥IGA.
       DATE-WRITTEN. 30-08-00.
       DATE-COMPILED.30-08-00.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT PUESTOS ASSIGN TO RANDOM "PUESTOS"
	   ACCESS MODE IS DYNAMIC
	   ORGANIZATION IS INDEXED
	   RECORD KEY IS CLAVE.

       DATA DIVISION.
       FILE SECTION.
       FD PUESTOS LABEL RECORD IS STANDARD.
       01 REGISTRO.
	   03 CLAVE PIC X(2).
	   03 NOMBRE PIC X(20).
	   03 SUELDO PIC 9(04).
       WORKING-STORAGE SECTION.
       01 ALFAS.
	   03 W-OPC    PIC 9.
	   03 W-CLAVE  PIC XX.
	   03 W-OPCION PIC X.
	   03 W-BORRA  PIC X.
       01 VARES.
	   03 CON PIC 99.
	   03 C PIC 99.

       PROCEDURE DIVISION.
       000-RUT-INICIO.
	   PERFORM 100-INICIO
	   PERFORM 200-PROCESO UNTIL W-OPCION='N' OR "n"
	   PERFORM 900-FINAL
	   STOP RUN.
       100-INICIO.
	   PERFORM 050-MARCOS.
	   MOVE SPACES TO ALFAS
	   OPEN OUTPUT PUESTOS
	   DISPLAY "PUESTOS" LINE 1 COL 10
	   DISPLAY "BAJAS" LINE 4 COL 20
	   DISPLAY "CLAVE DEL PUESTO" LINE 9 COL 10
	   DISPLAY "NOMBRE DEL PUESTO" LINE 12 COL 10
	   DISPLAY "SUELDO SEMANAL" LINE 15 COL 10.

       200-PROCESO.
	   MOVE SPACES TO ALFAS
	   ACCEPT W-CLAVE AT 0930
	   IF W-CLAVE=SPACES
	      DISPLAY "TECLEA DIFERENTE DE ESPACIOS"
	   ELSE
	      MOVE W-CLAVE TO CLAVE
	      PERFORM 300-LECTURA
	      IF W-OPC=0
		 DISPLAY NOMBRE AT 1230
		 DISPLAY SUELDO AT 1530
		 DISPLAY "ESTAS SEGURO DE BORRAR S/N"
		 ACCEPT W-BORRA AT 2055
		 IF W-BORRA='S' OR 's'
		    PERFORM 400-BORRA
		    DISPLAY "REGISTRO BORRADO" AT 2110
		 ELSE
		    DISPLAY "REGISTRO NO BORRADO" AT 2110
		 END-IF
	      ELSE
		 DISPLAY "LA CLAVE NO EXISTE" AT 2110
	      END-IF
	    END-IF
	    DISPLAY "¨DESEA SEGUIR BORRANDO?" AT 2210
	    ACCEPT W-OPCION AT 2235.


       300-LECTURA.
	   READ PUESTOS INVALID KEY MOVE 1 TO W-OPC.

       400-BORRA.
	   DELETE PUESTOS RECORD
	   INVALID KEY DISPLAY "ERROR" AT 2510.

       900-FINAL.
	   CLOSE PUESTOS.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING C FROM 1 BY 1 UNTIL C>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING C FROM 1 BY 1 UNTIL C>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE C COL 1.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE C COL 78.
