
       IDENTIFICATION DIVISION.
       PROGRAM-ID.BUSCA.
       AUTHOR.ZU¥IGA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CAMPO.
	   02 DATO OCCURS 30 TIMES PIC X.
       01 VARS.
           02 VOC  PIC 99.
           02 CON  PIC 99.
           02 BLA  PIC 99.
           02 ESP  PIC 99.
	   02 I    PIC 99.
	   02 NUM  PIC 99.
       01 OPC PIC X.
       01 VARES.
	   03 CONT PIC 99.
	   03 C PIC 99.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-SEGUIR UNTIL OPC="N" OR "n"
	   STOP RUN.

       100-SEGUIR.
	   PERFORM 050-MARCOS.
	   MOVE ZEROS TO VARS.
	   DISPLAY "TECLEA UNA CADENA DE CARACTERES: "AT 0512.
	   ACCEPT CAMPO.
	   PERFORM 200-ACEP VARYING I FROM 1 BY 1 UNTIL I>30
	   PERFORM 300-DESPLIEGA
	   DISPLAY "¨DESEA SEGUIR ESCRIBIENDO? S/N" AT 1805.
	   ACCEPT OPC AT 2005.

       200-ACEP.
	   IF (DATO(I)>="A" AND DATO(I)<="Z")
	      THEN
		  EVALUATE DATO(I)

			   WHEN "A"
				  COMPUTE VOC=1+VOC
			   WHEN "E"
				  COMPUTE VOC=1+VOC
			   WHEN "I"
				  COMPUTE VOC=1+VOC
			   WHEN "O"
				  COMPUTE VOC=1+VOC
			   WHEN "U"
				  COMPUTE VOC=1+VOC
			   WHEN OTHER
				  COMPUTE CON=1+CON
		  END-EVALUATE
	      ELSE
		  IF (DATO(I)=" ")
		     THEN
			 COMPUTE BLA=1+BLA
		     ELSE
			 IF (DATO(I)<="9" AND DATO(I)>="0") THEN
			   ADD 1 TO NUM
			 ELSE
			   COMPUTE ESP=1+ESP
			 END-IF
		  END-IF
	   END-IF.

                                   
       300-DESPLIEGA.
	   DISPLAY "SE ENCONTRARON     CARACTERES VOCALES" AT 0810
	   DISPLAY VOC AT  0826
	   DISPLAY "SE ENCONTRARON     ESPACIOS EN BLANCO" AT 1010
	   DISPLAY BLA AT 1026
	   DISPLAY "SE ENCONTRARON     CARACTERES CONSONANTES" AT 1210
	   DISPLAY CON AT 1226
	   DISPLAY "SE ENCONTRARON     CARACTERES ESPECIALES" AT 1410
	   DISPLAY ESP AT 1426
	   DISPLAY "SE ENCONTRARON     CARACTERES NUMEROS" AT 1610
	   DISPLAY NUM AT 1626.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CONT FROM 1 BY 1 UNTIL CONT>78.
	   PERFORM 2000-DESPLIEGA2 VARYING C FROM 1 BY 1 UNTIL C>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CONT FROM 1 BY 1 UNTIL CONT>78.
	   PERFORM 4000-DESPLIEGA4 VARYING C FROM 1 BY 1 UNTIL C>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CONT.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE C COL 1.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CONT.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE C COL 78.
