
       IDENTIFICATION DIVISION.
       PROGRAM-ID.CLASIF.
       AUTHOR.ZU¥IGA.
       DATE-WRITTEN. 29/08/00.
       DATE-COMPILED. 29/08/00.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CAMPO.
	   02 DATO OCCURS 30 TIMES PIC X.
       01 VARS.
           02 VOC  PIC 99.
           02 CON  PIC 99.
           02 BLA  PIC 99.
           02 ESP  PIC 99.
	   02 I    PIC 99.
	   02 NUM  PIC 99.
       PROCEDURE DIVISION.
       000-INICIO.
	   DISPLAY ERASE
	   MOVE ZEROS TO VARS
	   DISPLAY "TECLEA UNA CADENA DE CARACTERES "AT 0512
           ACCEPT CAMPO
           PERFORM 100-ACEP VARYING I FROM 1 BY 1 UNTIL I>30
           PERFORM 200-DESPLIEGA
       STOP RUN.

       100-ACEP.
	   IF (DATO(I)>="A" AND DATO(I)<="Z")
	      THEN
		  EVALUATE DATO(I)

			   WHEN "A"
				  COMPUTE VOC=1+VOC
			   WHEN "E"
				  COMPUTE VOC=1+VOC
			   WHEN "I"
				  COMPUTE VOC=1+VOC
			   WHEN "O"
				  COMPUTE VOC=1+VOC
			   WHEN "U"
				  COMPUTE VOC=1+VOC
			   WHEN OTHER
				  COMPUTE CON=1+CON
		  END-EVALUATE
	      ELSE
		  IF (DATO(I)=" ")
		     THEN
			 COMPUTE BLA=1+BLA
		     ELSE
			 IF (DATO(I)<="9" AND DATO(I)>="0") THEN
			   ADD 1 TO NUM
			 ELSE
			   COMPUTE ESP=1+ESP
			 END-IF
		  END-IF
	   END-IF.

                                   
       200-DESPLIEGA.
	   DISPLAY "SE ENCONTRARON     CARACTERES VOCALES" AT 1210
	   DISPLAY VOC AT  1226
	   DISPLAY "SE ENCONTRARON     ESPACIOS EN BLANCO" AT 1410
	   DISPLAY BLA AT 1426
	   DISPLAY "SE ENCONTRARON     CARACTERES CONSONANTES" AT 1610
	   DISPLAY CON AT 1626
	   DISPLAY "SE ENCONTRARON     CARACTERES ESPECIALES" AT 1810
	   DISPLAY ESP AT 1826
	   DISPLAY "SE ENCONTRARON     CARACTERES NUMEROS" AT 2010
	   DISPLAY NUM AT 2026.
