       IDENTIFICATION DIVISION.
       PROGRAM-ID.CONSULTA.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT MAESTRO ASSIGN TO "MAESTRO.DAT"
	   ACCESS MODE IS RANDOM
	   ORGANIZATION IS INDEXED
	   RECORD KEY IS NUM.
	   SELECT REPORTE ASSIGN TO "REPCON.DAT".

       DATA DIVISION.
       FILE SECTION.
       FD MAESTRO.
       01 REG-EMP.
	   02 NUM PIC 9(08).
	   02 NOM PIC X(20).
	   02 SUELDO PIC 9(06)V99.
	   02 FOM PIC 9(04)V99.
	   02 ISR PIC 9(04)V99.
	   02 CUO PIC 9(02)V99.
	   02 IMSS PIC 9(03)V99.
       FD REPORTE.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       01 ENCABEZADO-REPORTE.
	   02 FILLER PIC X(30) VALUE SPACES.
	   02 FILLER PIC X(20) VALUE "REPORTE DE CONSULTAS".
	   02 FILLER PIC X(30) VALUE SPACES.
       01 ENCABEZADO-CLAUSULAS.
	   02 FILLER PIC X(6) VALUE "NUMERO".
	   02 FILLER PIC X(3) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "NOMBRE".
	   02 FILLER PIC X(15) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "SUELDO".
	   02 FILLER PIC X(6) VALUE SPACES.
	   02 FILLER PIC X(8) VALUE "FOMPENSA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(3) VALUE "ISR".
	   02 FILLER PIC X(7) VALUE SPACES.
	   02 FILLER PIC X(5) VALUE "CUOTA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(4) VALUE "IMSS".
       01 LINEA-R.
	   02 NUM-R PIC 9(8).
	   02 FILLER PIC X VALUE SPACES.
	   02 NOM-R PIC X(20).
	   02 FILLER PIC X VALUE SPACES.
	   02 SUELDO-R PIC $(4),$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 FOM-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 ISR-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 CUO-R PIC $$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 IMSS-R PIC $$$9.99.
       01 SW PIC 9.
       01 RES PIC X VALUE SPACES.
       01 OPC PIC X VALUE SPACES.
       COPY "C:\COBOL\BIN\PROM\MOSTRAR.wks".
      * COPY "C:\COBOL\BIN\PROM\VER.wks".

       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROM\MOSTRAR.ss".
       COPY "C:\COBOL\BIN\PROM\VER.ss".

       PROCEDURE DIVISION.
       00-INICIO.
	   PERFORM 01-ABRE
	   PERFORM 02-ENCABEZADOS
	   PERFORM 03-PROCESO UNTIL RES="N" OR "n"
	   PERFORM 04-CERRAR
       STOP RUN.

       01-ABRE.
	   OPEN INPUT MAESTRO.
	   OPEN EXTEND REPORTE.
       02-ENCABEZADOS.
	   WRITE LINEA FROM ENCABEZADO-REPORTE.
	   WRITE LINEA FROM ENCABEZADO-CLAUSULAS AFTER ADVANCING 1
	   LINES.

       03-PROCESO.
	   MOVE ZEROS TO SW.
	   DISPLAY G-MOSTRAR.
	   ACCEPT LINNUM-W.
	   MOVE NUM-W TO NUM.
	   READ MAESTRO INVALID KEY MOVE 1 TO SW.
	   IF SW=0 THEN
	     DISPLAY G-VER
	     MOVE NUM TO NUM-R
	     MOVE NOM TO NOM-R
	     MOVE SUELDO TO SUELDO-R
	     MOVE FOM TO FOM-R
	     MOVE ISR TO ISR-R
	     MOVE CUO TO CUO-R
	     MOVE IMSS TO IMSS-R
	     WRITE LINEA FROM LINEA-R
	   ELSE
	     DISPLAY "NO SE ENCONTRO EL REGISTRO" AT 2211
	     WITH HIGHLIGHT
	   END-IF.
	   DISPLAY "DESEA VER OTRO REGISTRO S/N" AT 2311
	   WITH HIGHLIGHT.
	   ACCEPT RES AT 2411 WITH HIGHLIGHT.
       04-CERRAR.
	   CLOSE MAESTRO.
	   CLOSE REPORTE.
