

       IDENTIFICATION DIVISION.
       PROGRAM-ID.FECHA.
       AUTHOR. ZU¥IGA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER.DX2.
       SOURCE-COMPUTER.DX2.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 TABLA-MESES.
	   03 FILLER PIC X(10) VALUE "ENERO     ".
	   03 FILLER PIC X(10) VALUE "FEBRERO   ".
	   03 FILLER PIC X(10) VALUE "MARZO     ".
	   03 FILLER PIC X(10) VALUE "ABRIL     ".
	   03 FILLER PIC X(10) VALUE "MAYO      ".
	   03 FILLER PIC X(10) VALUE "JUNIO     ".
	   03 FILLER PIC X(10) VALUE "JULIO     ".
	   03 FILLER PIC X(10) VALUE "AGOSTO    ".
	   03 FILLER PIC X(10) VALUE "SEPTIEMBRE".
	   03 FILLER PIC X(10) VALUE "OCTUBRE   ".
	   03 FILLER PIC X(10) VALUE "NOVIEMBRE ".
	   03 FILLER PIC X(10) VALUE "DICIEMBRE ".
       01 TABLA REDEFINES TABLA-MESES.
	   03 MESES OCCURS 12 TIMES PIC X(10).
       01 FECH PIC 9(6).
       01 NOSE	PIC 99.
       01 DIA	PIC 99.
       01 MES	PIC 99.

       PROCEDURE DIVISION.
       000-INICIO.
	   DISPLAY ERASE
	   PERFORM 100-PROCESO
       STOP RUN.

       100-PROCESO.
	    ACCEPT FECH FROM DATE
	    MOVE FECH TO DIA
	    COMPUTE FECH = FECH / 100
	    MOVE FECH TO MES
	    COMPUTE FECH = FECH / 100
	    MOVE FECH TO NOSE
	    DISPLAY DIA AT 1010
	    DISPLAY "DE" AT 1013
	    DISPLAY MESES(MES) AT 1016
	    DISPLAY " DEL 20" AT 1026
	    DISPLAY  NOSE AT 1033.
	    CALL "MARCO"
	    CANCEL "MARCO"
