       IDENTIFICATION DIVISION.
       PROGRAM-ID.EMPLE.
       AUTHOR.JOJUREZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       INPUT-OUTPUT SECTION.
	   SELECT MAESTRO ASSIGN TO "MAES.DAT".
       DATA DIVISION.
       FD MAESTRO.
       01 REG-EMP.
	   02 NUM PIC 9(08).
	   02 NOM PIC X(20).
	   02 SUELDO PIC 9(06)V99.
	   02 FOM PIC 9(04)V99.
	   02 ISR PIC 9(04)V99.
	   02 CUO PIC 9(02)V99.
	   02 IMSS PIC 9(03)V99.
       01 RESP PIC X VALUE SPACES.
       COPY "C:\COBOL\BIN\PROM\EMP.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROM\EMP.ss".
       PROCEDURE DIVISION.
       00-INICIO.
	   PERFORM 01-ABRE.
	   PERFORM 02-LIMPIA.
	   PERFORM 03-GENERAR UNTIL RESP="N" OR "n".
	   PERFORM 05-CERRAR.
	   STOP RUN.
       01-ABRE.
	   OPEN OUTPUT MAESTRO.
       02-LIMPIA.
	   MOVE ZEROS TO NUM-P.
	   MOVE SPACES TO NOM-P.
	   MOVE ZEROS TO SUELDO-P.
	   MOVE ZEROS TO FOM-P.
	   MOVE ZEROS TO ISR-P.
	   MOVE ZEROS TO CUO-P.
	   MOVE ZEROS TO IMSS-P.
       03-GENERAR.
	   DISPLAY G-EMP
	   ACCEPT LINNUM
	   ACCEPT LINNOM
	   ACCEPT LINSUELDO
	   ACCEPT LINFOM
	   ACCEPT LINISR
	   ACCEPT LINCUO
	   ACCEPT LINIMSS.
	   MOVE NUM-P TO NUM.
	   MOVE NOM-P TO NOM.
	   MOVE SUELDO-P TO SUELDO.
	   MOVE FOM-P TO FOM.
	   MOVE ISR-P TO ISR.
	   MOVE CUO-P TO CUO.
	   MOVE IMSS-P TO IMSS.
	   WRITE REG-EMP.
	   PERFORM 04-SEGUIR.
       04-SEGUIR.
	   DISPLAY "¨DESEA ESCRIBIR OTRO REGISTRO? S/N" LINE 24 COL 10
	   WITH HIGHLIGHT FOREGROUND-COLOR IS 8 BACKGROUND-COLOR IS 3.
	   ACCEPT RESP LINE 24 COL 36 WITH HIGHLIGHT FOREGROUND-COLOR
	   IS 9 BACKGROUND-COLOR IS 1.
       05-CERRAR.
	   CLOSE MAESTRO.
