       IDENTIFICATION DIVISION.
       PROGRAM-ID.ESPECIAL.
       AUTHOR.AXA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       SELECT ARCH-ESP ASSIGN TO "ARCH-ESP.DAT".
       SELECT ARCH-ESPS ASSIGN TO "ARCH-ESPS.DAT".
       SELECT ARCH-ESPO ASSIGN TO "ARCH-ESPO.DAT".
       SELECT REPORTE ASSIGN TO "REPORTE".
       DATA DIVISION.
       FILE SECTION.
       FD ARCH-ESP.
       01 REG-ESP.
	    02 BOLETA PIC X(08).
	    02 NOMBRE PIC X(30).
	    02 PERIODO PIC 9(02).
	    02 ESPECIAL PIC 9(01).
	    02 PROMEDIO PIC 9(02)V99.
       SD ARCH-ESPS.
       01 REG-ESPS.
	    02 FILLER PIC X(38).
	    02 PER-S PIC 9(02).
	    02 ESP-S PIC 9.
	    02 PROM-S PIC 99V99.
       FD ARCH-ESPO.
       01 REG-ESPO.
	    02 BOLETA-O PIC X(08).
	    02 NOMBRE-O PIC X(30).
	    02 PERIODO-O PIC 9(02).
	    02 ESPECIAL-O PIC 9.
	    02 PROMEDIO-O PIC 9(02)V99.
       FD REPORTE.
       01 LINEA PIC X(80).

       WORKING-STORAGE SECTION.
       01 FECHA.
	   02 DIA-P PIC 99 VALUE ZEROS.
	   02 MES-P PIC 99 VALUE ZEROS.
	   02 ANIO-P PIC 99 VALUE ZEROS.
       01 HORA.
	   02 HOR-P PIC 99 VALUE ZEROS.
	   02 MINUT-P  PIC 99 VALUE ZEROS.
	   02 SEGUN-P PIC 99 VALUE ZEROS.
	01 ENCABEZADO1-ESP.
	    02 FILLER PIC X(06) VALUE SPACES.
	    02 FILLER PIC X(05) VALUE "FECHA".
	    02 FILLER PIC X	 VALUE SPACES.
	    02 DIA-R  PIC 99.
	    02 FILLER PIC X VALUE "/".
	    02 MES-R  PIC 99.
	    02 FILLER PIC X VALUE "/".
	    02 ANIO-R PIC 99.
	    02 FILLER PIC X(10) VALUE SPACES
	    02 FILLER PIC X(04) VALUE "HORA".
	    02 FILLER PIC X VALUE SPACES.
	    02 HOR-R PIC 99.
	    02 FILLER PIC X VALUE ":"
	    02 MINUT-R PIC 99.
	    02 FILLER PIC X VALUE ":".
	    02 SEGU-R PIC 99.

       01 ENCABEZADO2-ESP.
	    02 FILLER PIC X(31) VALUE SPACES.
	    02 FILLER PIC X(18) VALUE "REPORTE DE ALUMNOS".
	    02 FILLER PIC X(31) VALUE SPACES.
	01 ENCABEZADO3-ESP.
	    02 FILLER PIC X(03) VALUE SPACES.
	    02 FILLER PIC X(13) VALUE "PERIODO ANUAL".
	    02 FILLER PIC X(13) VALUE SPACES.
	    02 FILLER PIC X(12) VALUE "ESPECIALIDAD".
	    02 FILLER PIC X(13) VALUE SPACES.
	    02 FILLER PIC X(06) VALUE "NOMBRE".
	    02 FILLER PIC X(13) VALUE SPACES.
	    02 FILLER PIC X(08) VALUE "PROMEDIO".
	    02 FILLER PIC X(3) VALUE SPACES.
       01 TABLA-MES.
	    02 FILLER  PIC X(10) VALUE "  ENERO   ".
	    02 FILLER  PIC X(10) VALUE "  FEBRERO ".
	    02 FILLER  PIC X(10) VALUE "  MARZO   ".
	    02 FILLER  PIC X(10) VALUE "  ABRIL   ".
	    02 FILLER  PIC X(10) VALUE "  MAYO    ".
	    02 FILLER  PIC X(10) VALUE "  JUNIO   ".
	    02 FILLER  PIC X(10) VALUE "  JULIO   ".
	    02 FILLER  PIC X(10) VALUE "  AGOSTO  ".
	    02 FILLER  PIC X(10) VALUE "SEPTIEMBRE".
	    02 FILLER  PIC X(10) VALUE "  OCTUBRE ".
	    02 FILLER  PIC X(10) VALUE " NOVIEMBRE".
	    02 FILLER  PIC X(10) VALUE " DICIEMBRE".
       01 MES-TABLA REDEFINES TABLA-MES.
	    02 MES PIC X(10) OCCURS 12 TIMES.

       01 TABLA-ESP.
	  02 FILLER PIC X(12) VALUE " SISTEMAS   ".
	  02 FILLER PIC X(12) VALUE " MAQUINAS   ".
	  02 FILLER PIC X(12) VALUE "PROGRAMACION".
       01 ESP-TAB REDEFINES TABLA-ESP.
	  02 ESPE PIC X(12) OCCURS 3 TIMES.
       01 LINEA-R.
	  02 PERIODO-R PIC 99.
	  02 FILLER PIC X(14) VALUE SPACES.
	  02 ESPECIAL-R PIC X(10).
	  02 FILLER PIC X(14) VALUE SPACES.
	  02 NOMBRE-R PIC X(30).
	  02 FILLER PIC X(14) VALUE SPACES.
	  02 PROMEDIO-R PIC 99V99.
	  02 FILLER PIC X(14) VALUE SPACES.
       01 RESP	PIC X.
       01 SW PIC X.
       COPY "C:\MATUTINO\QUINTO\506\LABCOBOL\PANTESP.WKS".
       SCREEN SECTION.
       COPY "C:\MATUTINO\QUINTO\506\LABCOBOL\PANTESP.SS".
       PROCEDURE DIVISION.
       00-INICIO.
	PERFORM 01-ABRE
	PERFORM 02-BORRA
	PERFORM 03-TRASPASA
	PERFORM 04-ENCABEZADO
	PERFORM 05-PROCESO UNTIL RESP = "n" OR "N"
	PERFORM 06-ORDENA
	PERFORM 07-COPIA
	PERFORM 08-CIERRA
	STOP RUN.

       01-ABRE.
	 OPEN OUTPUT ARCH-ESP.

       02-BORRA.
	 MOVE ZEROS TO PERIODO
	 MOVE ZEROS TO ESPECIAL
	 MOVE ZEROS TO NOMBRE
	 MOVE ZEROS TO PROMEDIO
	 MOVE ZEROS TO SW.
       03-TRASPASA.
	ACCEPT FECHA FROM DATE
	MOVE MES(MES-P) TO MES-R
	MOVE DIA-P TO DIA-R
	MOVE ANIO-P TO ANIO-R
	ACCEPT HORA FROM TIME
	MOVE HOR-P TO HOR-R
	MOVE MINUT-P TO MINUT-R
	MOVE SEGUN-P TO SEGU-R.
       04-ENCABEZADO.
       WRITE LINEA FROM ENCABEZADO1-ESP AFTER ADVANCING 2 LINES
       WRITE LINEA FROM ENCABEZADO2-ESP AFTER ADVANCING 1 LINE
       WRITE LINEA FROM ENCABEZADO3-ESP AFTER ADVANCING 1 LINE.
       05-PROCESO.
       DISPLAY G-PANTESP
       ACCEPT LINBOLETA
       ACCEPT LINNOMBRE
       ACCEPT LINPERIODO
       ACCEPT LINESPECIAL
       ACCEPT LINPROMEDIO
       MOVE BOLETA-W TO BOLETA
       MOVE NOMBRE-W TO NOMBRE
       MOVE PERIODO-W TO PERIODO
       MOVE ESPECIAL-W TO ESPECIAL
       MOVE PROMEDIO TO PROMEDIO
       DISPLAY "DESEA SEGUIR TECLEEANDO S/N" AT 2021
       ACCEPT RESP AT LINE 20 COL 30 WITH HIGHLIGHT.
       06-ORDENA.
       CLOSE ARCH-ESP
       SORT ARCH-ESPS
       ON ASCENDING KEY PER-S
       ON ASCENDING KEY ESP-S
       ON DESCENDING KEY PROM-S
       USING ARCH-ESP
       GIVING ARCH-ESPO.
       07-COPIA.
       OPEN  INPUT ARCH-ESPO
	      OUTPUT REPORTE.
       READ ARCH-ESPO AT END MOVE 1 TO SW.
       IF (SW=0)
       THEN

       MOVE NOMBRE TO NOMBRE-R
       MOVE PERIODO TO PERIODO-R
       MOVE ESPE(ESPECIAL-W) TO ESPECIAL-R
       MOVE PROMEDIO TO PROMEDIO-R
       WRITE LINEA FROM LINEA-R AFTER ADVANCING 1 LINE.
       08-CIERRA.
       CLOSE ARCH-ESPO.
       CLOSE REPORTE.
