       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOR6.
       AUTHOR. AXA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OPC PIC X VALUE SPACES.
       01 NUME PIC 9 VALUE ZEROS.
       01 TABLA-DIAS.
	   02 FILLER	 PIC X(09) VALUE "DOMINGO  ".
	   02 FILLER	 PIC X(09) VALUE "LUNES    ".
	   02 FILLER	 PIC X(09) VALUE "MARTES   ".
	   02 FILLER	 PIC X(09) VALUE "MIERCOLES".
	   02 FILLER	 PIC X(09) VALUE "JUEVES   ".
	   02 FILLER	 PIC X(09) VALUE "VIERNES  ".
	   02 FILLER	 PIC X(09) VALUE "SABADO   ".
       01 TABLA REDEFINES TABLA-DIAS.
	  02 DIAS OCCURS 7 TIMES PIC X(09).
       PROCEDURE DIVISION.
       001-RUTINA-PRINCIPAL.
	   DISPLAY ERASE
	   PERFORM 100-PROCESO UNTIL OPC= "N"
	   STOP RUN.
       100-PROCESO.
       MOVE ZEROS TO NUME
       MOVE SPACES TO OPC
       DISPLAY "                            " LINE 20 POSITION 10
       DISPLAY "                      " LINE 6 POSITION 10
       DISPLAY "TECLEEA EL NUMERO DE DIA" LINE 5 POSITION 10
       ACCEPT NUME LINE 5 POSITION 35.
       IF NUME < 7
	   DISPLAY DIAS ( NUME ) LINE 6 POSITION 10.
	   DISPLAY "OTRO DIA S/N " LINE 210 POSITION 10
	   ACCEPT OPC LINE 20 POSITION 32.
