       IDENTIFICATION DIVISION.
       PROGRAM-ID.HOLA.
       ENVIRONMENT DIVISION.
       OBJECT-COMPUTER.IBM.
       SOURCE-COMPUTER.IBM.
       DATA DIVISION.
       01 NUMERO PIC 9999.
       01 LETRA PIC X.
       PROCEDURE DIVISION.
       DISPLAY "HOLA MUNDO" AT 1010.
       STOP RUN.
