       IDENTIFICATION DIVISION.
       PROGRAM-ID.INDEXADO.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT MAESTRO ASSIGN TO "MAESTRO"
	   ACCESS MODE IS SEQUENTIAL
	   ORGANIZATION IS INDEXED
	   RECORD KEY IS NUM.
	   SELECT REPORTE-EMPLEADOS ASSIGN TO "REPCREA.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD MAESTRO.
       01 REG-EMP.
	   02 NUM PIC 9(08).
	   02 NOM PIC X(20).
	   02 SUELDO PIC 9(06)V99.
	   02 FOM PIC 9(04)V99.
	   02 ISR PIC 9(04)V99.
	   02 CUO PIC 9(02)V99.
	   02 IMSS PIC 9(03)V99.
       FD REPORTE-EMPLEADOS.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       01 ENCABEZADO-REPORTE.
	   02 FILLER PIC X(30) VALUE SPACES.
	   02 FILLER PIC X(20) VALUE "REPORTE DE EMPLEADOS".
	   02 FILLER PIC X(30) VALUE SPACES.
       01 ENCABEZADO-CLAUSULAS.
	   02 FILLER PIC X(6) VALUE "NUMERO".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "NOMBRE".
	   02 FILLER PIC X(15) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "SUELDO".
	   02 FILLER PIC X(6) VALUE SPACES.
	   02 FILLER PIC X(8) VALUE "FOMPENSA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(3) VALUE "ISR".
	   02 FILLER PIC X(7) VALUE SPACES.
	   02 FILLER PIC X(5) VALUE "CUOTA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(4) VALUE "IMSS".
       01 LINEA-R.
	   02 NUM-R PIC 9(8).
	   02 FILLER PIC X VALUE SPACES.
	   02 NOM-R PIC X(20).
	   02 FILLER PIC X VALUE SPACES.
	   02 SUELDO-R PIC $(4),$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 FOM-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 ISR-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 CUO-R PIC $$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 IMSS-R PIC $$$9.99.
       01 SW PIC 9.
       01 RES PIC X VALUE SPACES.
       COPY "C:\COBOL\BIN\EMP.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\EMP.ss".
       PROCEDURE DIVISION.
       00-INICIO.
	   PERFORM 01-ABRE.
      *	   PERFORM 02-ENCABEZADOS.
	   PERFORM 03-LIMPIAR.
	   PERFORM 04-PROCESO UNTIL RES="N" OR "n".
	   PERFORM 06-CERRAR.
       STOP RUN.

       01-ABRE.
	   OPEN EXTEND MAESTRO
	   EXTEND REPORTE-EMPLEADOS.
      *02-ENCABEZADOS.
	   WRITE LINEA FROM ENCABEZADO-REPORTE AFTER ADVANCING 2 LINES.
	   WRITE LINEA FROM ENCABEZADO-CLAUSULAS.
       03-LIMPIAR.
	   MOVE ZEROS TO NUM-P.
	   MOVE SPACES TO NOM-P.
	   MOVE ZEROS TO SUELDO-P.
	   MOVE ZEROS TO FOM-P.
	   MOVE ZEROS TO ISR-P.
	   MOVE ZEROS TO CUO-P.
	   MOVE ZEROS TO IMSS-P.
	   MOVE ZEROS TO SW.
       04-PROCESO.
	   DISPLAY G-EMP.
	   ACCEPT LINNUM
	   ACCEPT LINNOM
	   ACCEPT LINSUELDO
	   ACCEPT LINFOM
	   ACCEPT LINISR
	   ACCEPT LINCUO
	   ACCEPT LINIMSS.
	   MOVE NUM-P TO NUM NUM-R
	   MOVE NOM-P TO NOM NOM-R
	   MOVE SUELDO-P TO SUELDO SUELDO-R
	   MOVE FOM-P TO FOM FOM-R
	   MOVE ISR-P TO ISR ISR-R
	   MOVE CUO-P TO CUO CUO-R
	   MOVE IMSS-P TO IMSS IMSS-R

	   WRITE REG-EMP INVALID KEY DISPLAY "ERROR" MOVE 1 TO SW.
	   IF SW=0 THEN
	   WRITE LINEA FROM LINEA-R
	   END-IF
	   PERFORM 05-SEGUIR.
       05-SEGUIR.
	   DISPLAY "¨DESEA ESCRIBIR OTRO REGISTRO? S/N" LINE 24 COL 10
	   WITH HIGHLIGHT.
	   ACCEPT RES LINE 24 COL 50 WITH HIGHLIGHT.

       06-CERRAR.
	   CLOSE MAESTRO.
	   CLOSE REPORTE-EMPLEADOS.
