       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\PROGRA~1\JUAN.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROGRA~1\JUAN.ss".
       PROCEDURE DIVISION.
           DISPLAY G-JUAN.
           ACCEPT G-JUAN.
           STOP RUN.
