       IDENTIFICATION DIVISION.
       PROGRAM-ID.LECTURA.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT MAESTRO ASSIGN TO "MAESTRO.DAT"
	   SELECT REPORTE-EMPLEADOS ASSIGN TO "REPEMP.DAT"
	   ACCESS MODE IS SEQUENTIAL
	   ORGANIZATION IS INDEXED
	   RECORD KEY IS NUM.
       DATA DIVISION.
       FILE SECTION.
       FD MAESTRO.
       01 REG-EMP.
	   02 NUM PIC 9(08).
	   02 NOM PIC X(20).
	   02 SUELDO PIC 9(06)V99.
	   02 FOM PIC 9(04)V99.
	   02 ISR PIC 9(04)V99.
	   02 CUO PIC 9(02)V99.
	   02 IMSS PIC 9(03)V99.
       FD REPORTE-EMPLEADOS.
       01 LINEA PIC X(80).
       WORKING-STORAGE SECTION.
       01 ENCABEZADO-REPORTE.
	   02 FILLER PIC X(30) VALUE SPACES.
	   02 FILLER PIC X(20) VALUE "REPORTE DE EMPLEADOS".
	   02 FILLER PIC X(30) VALUE SPACES.
       01 ENCABEZADO-CLAUSULAS.
	   02 FILLER PIC X(6) VALUE "NUMERO".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "NOMBRE".
	   02 FILLER PIC X(15) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "SUELDO".
	   02 FILLER PIC X(6) VALUE SPACES.
	   02 FILLER PIC X(8) VALUE "FOMPENSA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(3) VALUE "ISR".
	   02 FILLER PIC X(7) VALUE SPACES.
	   02 FILLER PIC X(5) VALUE "CUOTA".
	   02 FILLER PIC X(2) VALUE SPACES.
	   02 FILLER PIC X(4) VALUE "IMSS".
       01 LINEA-R.
	   02 NUM-R PIC 9(8).
	   02 FILLER PIC X VALUE SPACES.
	   02 NOM-R PIC X(20).
	   02 FILLER PIC X VALUE SPACES.
	   02 SUELDO-R PIC $(4),$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 FOM-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 ISR-R PIC $$,$$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 CUO-R PIC $$9.99.
	   02 FILLER PIC X VALUE SPACES.
	   02 IMSS-R PIC $$$9.99.
       01 SWFIN PIC 9.
       01 RES PIC X VALUE VALUE SPACES.
       COPY "C:\MATUTINO\CUARTO\408\COBOL\PAN.wks".
       SCREEN SECTION.
       COPY "C:\MATUTINO\CUARTO\408\COBOL\PAN.ss".
       PROCEDURE DIVISION.
       00-INICIO.
	   PERFORM 01-ABRE.
	   PERFORM 02-LIMPIAR.
	   PERFORM 03-PROCESO UNTIL RES="N" OR "n".
	   PERFORM 05-ENCABEZADOS.
	   PERFORM FB1-LECTURA.
	   PERFORM 06-FORMATEANDO UNTIL SWFIN=1.
	   PERFORM 07-CERRAR.
       STOP RUN.

       01-ABRE.
	   OPEN INPUT MAESTRO
	   OUTPUT REPORTE-EMPLEADOS.
       02-LIMPIAR.
	   MOVE ZEROS TO NUM-W.
	   MOVE SPACES TO NOM-W.
	   MOVE ZEROS TO SUELDO-W.
	   MOVE ZEROS TO FOM-W.
	   MOVE ZEROS TO ISR-W.
	   MOVE ZEROS TO CUO-W.
	   MOVE ZEROS TO IMSS-W.
	   MOVE ZEROS TO SWFIN.
       03-PROCESO.
	   DISPLAY G-EMP
	   ACCEPT LINNUM
	   ACCEPT LINNOM
	   ACCEPT LINSUELDO
	   ACCEPT LINFOM
	   ACCEPT LINISR
	   ACCEPT LINCUO
	   ACCEPT LINIMSS.
	   MOVE NUM-W TO NUM.
	   MOVE NOM-W TO NOM.
	   MOVE SUELDO-W TO SUELDO.
	   MOVE FOM-W TO FOM.
	   MOVE ISR-W TO ISR.
	   MOVE CUO-W TO CUO.
	   MOVE IMSS-W TO IMSS.
	   WRITE REG-EMP INVALID KEY DISPLAY "ERROR".
	   PERFORM 04-SEGUIR.
       04-SEGUIR.
	   DISPLAY "¨DESEA ESCRIBIR OTRO REGISTRO? S/N" LINE 24 COL 10
	   WITH HIGHLIGHT.
	   ACCEPT RES LINE 24 COL 36 WITH HIGHLIGHT.
       05-ENCABEZADOS.
	   WRITE LINEA FROM ENCABEZADO-REPORTE AFTER ADVANCING 2 LINES.
	   WRITE LINEA FROM ENCABEZADO-CLAUSULAS.
       FB1-LECTURA.
	   READ MAESTRO AT END MOVE 1 TO SWFIN.
       06-FORMATEANDO.
	   MOVE NUM TO NUM-R.
	   MOVE NOM TO NOM-R.
	   MOVE SUELDO TO SUELDO-R.
	   MOVE FOM TO FOM-R.
	   MOVE ISR TO ISR-R.
	   MOVE CUO TO CUO-R.
	   MOVE IMSS TO IMSS-R.
	   WRITE LINEA FROM LINEA-R.
	   PERFORM FB1-LECTURA.
       07-CERRAR.
	   CLOSE MAESTRO.
