       IDENTIFICATION DIVISION.
       PROGRAM-ID.link2.
       AUTHOR.
       DATE-WRITTEN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       DATA DIVISION.
       LINKAGE SECTION.
       01 ALFAS.
	   03 NUMERICAS PIC 999 VALUE ZEROS.
       PROCEDURE DIVISION USING ALFAS.
       001-RUTINA-PRINCIPAL.
	   DISPLAY "EL NUMERO ES " AT 0302
	   DISPLAY NUMERICAS
	   EXIT PROGRAM.
