       IDENTIFICATION DIVISION.
       PROGRAM-ID.link1.
       AUTHOR.
       DATE-WRITTEN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ALFAS.
	   03 NUMERICAS PIC 999 VALUE ZEROS.
       PROCEDURE DIVISION.
       001-RUTINA-PRINCIPAL.
	   DISPLAY ERASE
	   MOVE ZEROS TO NUMERICAS
	   DISPLAY "TECLE UN NUMERO  " AT 0202
	   ACCEPT NUMERICAS
	   CALL "link2" USING ALFAS.
	   STOP RUN.
