      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.LLAMADAIF.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 EDITAR.
	   03 CONT1E PIC ZZ.
	   03 CONT2E PIC ZZZ.
	   03 CONT3E PIC ZZZ.ZZ.
	   03 MINE PIC ZZZ.
       01 VARS.
	   03 LOCAL PIC 99V99.
	   03 NAL PIC 99V99.
	   03 INT PIC 99V99.
	   03 MIN PIC 999.
	   03 OPC1 PIC 9.
	   03 CONT1 PIC 99.
	   03 CONT2 PIC 999.
	   03 CONT3 PIC 9999V99.
       01 C PIC 9 VALUE 1.
       01 OPC2 PIC X.
       01 VARES.
	   03 CON PIC 99.
	   03 CO PIC 99.
       PROCEDURE DIVISION.
       000-INICIO.
	   MOVE ZEROS TO VARS.
	   PERFORM 100-LLAMADAS UNTIL OPC2="N" OR "n"
	   PERFORM 200-DESPLIEGA
	   STOP RUN.

       100-LLAMADAS.
	   PERFORM 050-MARCOS.
	   DISPLAY "MENU PRINCIPAL" AT 0810.
	   DISPLAY "1.LLAMADA LOCAL" AT 1010.
	   DISPLAY "2.LLAMADA NACIONAL" AT 1210.
	   DISPLAY "3.LLAMADA INTERNACIONAL" AT 1410.
	   DISPLAY "ELIJA SU OPCION:" AT 1610
	   ACCEPT OPC1 AT 1810.
	   EVALUATE OPC1
	   WHEN 1
	   PERFORM 050-MARCOS
	     DISPLAY "¨CUANTOS MINUTOS VA A HABLAR?" AT 0810
	     ACCEPT MINE AT 1010
	     MOVE MINE TO MIN
	     COMPUTE LOCAL=MIN*0.80
	     COMPUTE CONT1=CONT1+C
	     COMPUTE CONT2=CONT2+MIN
	     COMPUTE CONT3=CONT3+LOCAL
	   WHEN 2
	   PERFORM 050-MARCOS
	     DISPLAY "¨CUANTOS MINUTOS VA A HABLAR?" AT 0810
	     ACCEPT MINE AT 1010
	     MOVE MINE TO MIN
	     COMPUTE NAL=MIN*1.50
	     COMPUTE CONT1=CONT1+C
	     COMPUTE CONT2=CONT2+MIN
	     COMPUTE CONT3=CONT3+NAL
	   WHEN 3
	   PERFORM 050-MARCOS
	     DISPLAY "¨CUANTOS MINUTOS VA A HABLAR?" AT 0810
	     ACCEPT MINE AT 1010
	     MOVE MINE TO MIN
	     COMPUTE INT=MIN*2.00
	     COMPUTE CONT1=CONT1+C
	     COMPUTE CONT2=CONT2+MIN
	     COMPUTE CONT3=CONT3+INT
	   WHEN OTHER
	   PERFORM 050-MARCOS
	     DISPLAY "ERROR VERIFIQUE SU OPCION" AT 0810
	   END-EVALUATE.
	   DISPLAY "DESEA LLAMAR OTRA VEZ: S/N" AT 1210.
	   ACCEPT OPC2 AT 1410.
       200-DESPLIEGA.
	   MOVE CONT1 TO CONT1E.
	   MOVE CONT2 TO CONT2E.
	   MOVE CONT3 TO CONT3E.
	   PERFORM 050-MARCOS.
	   DISPLAY "SU NUMERO DE LLAMADAS FUE:" AT 0810.
	   DISPLAY CONT1E AT 1010.
	   DISPLAY "EL TOTAL DE MINUTOS FUE:" AT 1210.
	   DISPLAY CONT2E AT 1410.
	   DISPLAY "EL COSTO TOTAL DE LAS LLAMADAS ES:" AT 1610.
	   DISPLAY CONT3E AT 1810.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING CO FROM 1 BY 1 UNTIL CO>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING CO FROM 1 BY 1 UNTIL CO>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON
	   WITH HIGHLIGHT BACKGROUND-COLOR IS 1 FOREGROUND-COLOR IS 4.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE CO COL 1
	   WITH HIGHLIGHT BACKGROUND-COLOR IS 2 FOREGROUND-COLOR IS 11.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON
	   WITH HIGHLIGHT BACKGROUND-COLOR IS 3 FOREGROUND-COLOR IS 9.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE CO COL 78
	   WITH HIGHLIGHT BACKGROUND-COLOR IS 4 FOREGROUND-COLOR IS 2.
