       IDENTIFICATION DIVISION.
       PROGRAM-ID.CLASIF.
       AUTHOR.ZU¥IGA.
       DATE-WRITTEN. 29/08/00.
       DATE-COMPILED. 29/08/00.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VARS.
	   03 CON PIC 99.
	   03 C PIC 99.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78
	   PERFORM 2000-DESPLIEGA2 VARYING C FROM 1 BY 1 UNTIL C>24
	   MOVE ZEROS TO VARS.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78
	   PERFORM 4000-DESPLIEGA4 VARYING C FROM 1 BY 1 UNTIL C>24
	   STOP RUN.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE C COL 1.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE C COL 78.
