       IDENTIFICATION DIVISION.
       PROGRAM-ID.MENU.
       AUTHOR.ZU¥IGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\MENU.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\MENU.ss".
       PROCEDURE DIVISION.
           DISPLAY G-MENU.
	   ACCEPT G-MENU.
	   EVALUATE OPC
	   WHEN 1
	    CALL "CREACION"
	    CANCEL "CREACION"
	   WHEN 2
	    CALL "ALTAS"
	    CANCEL "ALTAS"
	   WHEN 3
	    CALL "BAJAS"
	    CANCEL "BAJAS"
	   WHEN 4
	    CALL "CONSULTA"
	    CANCEL "CONSULTA"
	   WHEN 5
	    CALL "CAMBIOS"
	    CANCEL "CAMBIOS"
	   WHEN 6
	    DISPLAY "GRACIAS POR DEJAR DE TRABAJARME" AT 2424 WITH
	    HIGHLIGHT
	   WHEN OTHER
	    DISPLAY "ERROR VERIFIQUE SU OPCION" AT 2424 WITH
	    HIGHLIGHT
	   END-EVALUATE.
           STOP RUN.
