       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\PROM\MENU.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROM\MENU.ss".
       PROCEDURE DIVISION.
           DISPLAY G-MENU.
           ACCEPT G-MENU.
           STOP RUN.
