      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.MESES.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OPC PIC X VALUE SPACES.
       01 NUM PIC 99.
       01 NUME PIC ZZ.
       01 TABLA-MESES.
	   02 FILLER	 PIC X(10) VALUE "ENERO     ".
	   02 FILLER	 PIC X(10) VALUE "FEBRERO   ".
	   02 FILLER	 PIC X(10) VALUE "MARZO     ".
	   02 FILLER	 PIC X(10) VALUE "ABRIL     ".
	   02 FILLER	 PIC X(10) VALUE "MAYO      ".
	   02 FILLER	 PIC X(10) VALUE "JUNIO     ".
	   02 FILLER	 PIC X(10) VALUE "JULIO     ".
	   02 FILLER	 PIC X(10) VALUE "AGOSTO    ".
	   02 FILLER	 PIC X(10) VALUE "SEPTIEMBRE".
	   02 FILLER	 PIC X(10) VALUE "OCTUBRE   ".
	   02 FILLER	 PIC X(10) VALUE "NOVIEMBRE ".
	   02 FILLER	 PIC X(10) VALUE "DICIEMBRE ".
       01 TABLA REDEFINES TABLA-MESES.
	  02 MESES OCCURS 12 TIMES PIC X(10).
       PROCEDURE DIVISION.
       000-RUTINA-PRINCIPAL.
	   DISPLAY ERASE.
	   PERFORM 100-PROCESO UNTIL OPC= "N" OR "n"
	   STOP RUN.
       100-PROCESO.
       DISPLAY ERASE
       MOVE ZEROS TO NUME
       MOVE SPACES TO OPC
       DISPLAY "TECLEA EL NUMERO DE MES" LINE 5 POSITION 10
       ACCEPT NUME LINE 5 POSITION 35 WITH PROMPT.
       MOVE NUME TO NUM
       IF NUME < 12
	   DISPLAY MESES ( NUME ) LINE 6 POSITION 10
	   DISPLAY "OTRO MES S/N " AT 3010
	   ACCEPT OPC AT 3210.
