       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\PROM\MOSTRAR.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROM\MOSTRAR.ss".
       PROCEDURE DIVISION.
           DISPLAY G-MOSTRAR.
           ACCEPT G-MOSTRAR.
           STOP RUN.
