      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.NUMERO.
       AUTHOR.ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VARS.
	   03 X PIC 99.
	   03 Y PIC 99.
	   03 Z PIC 999.
	   03 W PIC 9.
	   03 CONT PIC 999.
       PROCEDURE DIVISION.
       000-INICIO.
	   MOVE ZEROS TO VARS.
	   MOVE 10 TO CONT.
	   PERFORM 100-DESPLIEGA VARYING Z FROM 1 BY 1 UNTIL Z>40
	   STOP RUN.

       100-DESPLIEGA.
	   PERFORM 200-NUM VARYING Z FROM 1 BY 1 UNTIL Z>CONT
	   ADD 4 TO X.
	   MOVE ZEROS TO Y.
	   ADD 10 TO CONT.

       200-NUM.
	   DISPLAY Z LINE Y COL X.
	   ADD 1 TO Y.
