      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.NUMEROS.
       AUTHOR.ZU¥IGA.
       DATE-WRITTEN.14-08-00.
       DATE-COMPILED.14-08-00.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CAMPO OCCURS 5 TIMES.
	   03 DATOE PIC ZZZZ.
	   03 DATO PIC 9999.
       01 VARS.
	   03 C PIC 99999.
	   03 PROM PIC 9999V99.
	   03 I PIC 9.
       01 CE PIC ZZZZZ.
       01 PROME PIC ZZZZ.ZZ.
       01 OPC PIC X.
       PROCEDURE DIVISION.
       000-PRINCIPAL.
	   PERFORM 100-HACER UNTIL OPC="N" OR "n"
	   STOP RUN.

       100-HACER.
	   MOVE ZEROS TO VARS.
	   PERFORM 200-ACEPTA VARYING I FROM 1 BY 1 UNTIL I>5
	   COMPUTE PROM=C/5.
	   MOVE C TO CE.
	   MOVE PROM TO PROME.
	   DISPLAY ERASE "EL RESULTADO DE LA SUMA ES:" AT 1010.
	   DISPLAY CE AT 1210.
	   DISPLAY "EL PROMEDIO ES:" AT 1410.
	   DISPLAY PROME AT 1610.
	   DISPLAY "DESEA HACER OTRA EJECUCION" AT 1810.
	   ACCEPT OPC AT 2010.

       200-ACEPTA.
	   DISPLAY ERASE.
	   DISPLAY "INTRODUZCA DATO" AT 1010.
	   ACCEPT DATOE(I) LINE 12 POSITION 10.
	   MOVE DATOE(I) TO DATO(I).
	   COMPUTE C=C+DATO(I).
