       IDENTIFICATION DIVISION.
       PROGRAM-ID.ORDENAR.
       AUTHOR.JOJUREZU¥IGA.
       ENVIRONMENT DIVISION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       INPUT-OUTPUT SECTION.
       PROCEDURE DIVISION.
       10-MODULO-PRINCIPAL.
	   SORT ARCH-CLASIF
	   ON ASCENDING KEY NUM
	   USING ARCH-MAESTRO-DESORDENADO
	   GIVING ARCH-MAESTRO-ORDENADO.
	   STOP RUN.
