       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\PAN1.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PAN1.ss".
       PROCEDURE DIVISION.
           DISPLAY G-PAN1.
           ACCEPT G-PAN1.
           STOP RUN.
