       IDENTIFICATION DIVISION.
       PROGRAM-ID.PRAC9.
       AUTHOR.RAMIREZ GUZMAN EDGAR ALEJANDRO.
       DATE-WRITTEN.19-08-00.
       DATE-COMPILED.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM-5.
       OBJECT-COMPUTER.IBM-5.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT ENTRADAS ASSIGN TO INPUT "ENTRADAS"
	   ORGANIZATION IS SEQUENTIAL
	   ACCESS MODE IS SEQUENTIAL.
	   SELECT SALIDAS ASSIGN TO OUTPUT "SALIDAS".
	   SELECT SORTEO ASSIGN TO "SORTEO".
       DATA DIVISION.
       FD ENTRADAS.
	   DATA RECORD IS REGISTRO.
       01 REGISTRO.
	   03 NOMBRE PIC X(30).
	   03 DEPTO  PIC X(30).
	   03 SUELDO PIC 9(07).
       FD SALIDAS.
	   DATA RECORD IS REGISTRO-S.
       01 REGISTRO-S.
	   03 NOMBRE-S PIC X(30).
	   03 DEPTO-S  PIC X(30).
	   03 SUELDO-S PIC 9(07).
       SD SORTEO.
	   DATA RECORD IS REG-SOR.
       01 REG-SOR.
	   03 NOMBRE-SS PIC X(30).
	   03 DEPTO-SS	PIC X(30).
	   03 SUELDO-SS PIC 9(07).
       FD REPORTE-EMPLEADOS.
	   DATA RECORD IS REGISTRO-S.
       01 LINEA PIC X(30).
       WORKING-STORAGE SECTION.
       01 RESP PIC A.
       01 SW   PIC 9.
       01 I    PIC 99.
       01 TOT  PIC $Z(14).
       01 REG.
	   03 NUM PIC X(30).
	   03 DEP PIC X(30).
	   03 SUE PIC 9(07).
       01 ENCABEZADO1-TRABAJO.
	   02 FILLER PIC X(29) VALUE SPACES.
	   02 FILLER PIC X(21) VALUE "REGISTRO DE EMPLEADOS".
	   02 FILLER PIC X(30) VALUE SPACES.
       01 TITULO PIC X(40) VALUE ALL "*-".
       01 ENCABEZADO2-TRABAJO.
	   02 FILLER PIC X(6) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "NOMBRE".
	   02 FILLER PIC X(24) VALUE SPACES.
	   02 FILLER PIC X(12) VALUE "DEPARTAMENTO".
	   02 FILLER PIC X(18) VALUE SPACES.
	   02 FILLER PIC X(6) VALUE "SUELDO".
	   02 FILLER PIC X(8) VALUE SPACES.
       01 TITULO PIC X(40) VALUE ALL "*-".
       01 LINEA-R.
	   02 FILLER   PIC X(6) VALUE SPACES.
	   02 NOMBRE-R PIC X(30).
	   02 DEPTO-R  PIC X(30).
	   02 SUELDO-R PIC $$,$$$,$$9.99.
	   02 FILLER PIC X(10) VALUE SPACES.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-CEROS
	   PERFORM 200-PROCESO UNTIL RESP='s' OR 'S'
	   CLOSE ENTRADAS
	   PERFORM 300-RUTSORT
	   PERFORM 400-PRINCIPAL.
       100-CEROS.
	   MOVE SPACES TO REGISTRO
	   MOVE SPACES TO REGISTRO-S
	   MOVE SPACES TO REG-SOR
	   MOVE SPACE TO RESP
	   MOVE SPACES TO REG
	   MOVE ZERO TO SW
	   MOVE ZERO TO I
	   MOVE ZEROS TO TOT
	   MOVE ZEROS TO SUE.
       200-PROCESO.
	   DISPLAY ERASE
	   PERFORM 250-HOR VARYING I FROM 20 BY 1 UNTIL I>50
	   PERFORM 270-VER VARYING I FROM 7 BY 1 UNTIL I>25
	   DISPLAY "REGISTRO DE EMPLEADOS" LINE 9 COL 25
	   DISPLAY "NOMBRE:" LINE 12 COL 23
	   ACCEPT NOM WITH PROMPT AT LINE 13 COL 21
	   DISPLAY "DEPARTAMENTO:" LINE 15 COL 23
	   ACCEPT DEP WITH PROMPT AT LINE 16 COL 23
	   DISPLAY "SUELDO:" LINE 18 COL 23
	   ACCEPT SUE WITH PROMPT SIZE 7 RIGHT-JUSTIFY AT LINE 19 COL 21
	   COMPUTE TOT=SUE+SUE
	   MOVE NOM TO NOMBRE
	   MOVE DEP TO DEPTO
	   MOVE SUE TO SUELDO
	   WRITE REGISTRO
	   DISPLAY "DESEAS REGISTRAR OTRO?" LINE 23 COL 23
	   ACCEPT RESP WITH AUTO AT LINE COL 45.
       250-HOR.
	   DISPLAY "*" AT 7 COL I
	   DISPLAY "*" AT 11 COL I
	   DISPLAY "*" AT 21 COL I
	   DISPLAY "*" AT 25 COL I.
       270-VER.
	   DISPLAY "*" AT I COL 20
	   DISPLAY "*" AT I COL 50.
       300-RUTSORT.
	   SORT SORTEO ASCENDING KEY DEPTO-SS
		       DESCENDING KEY NOMBRE-SS
		USING ENTRADAS
		GIVING SALIDAS.
       400-PRINCIPAL.
	   OPEN INPUT SALIDAS
	   PERFORM 450-ENCABEZADOS
	   PERFORM 550-LECTURA
	   PERFORM 500-PROCESO UNTIL SW=1
	   CLOSE SALIDAS
	   DISPLAY "EL TOTAL DE LOS SUELDOS ES:" TOT LINE 15 COL 22
	   ACCEPT SW
	   STOP RUN.
       450-ENCABEZADOS.
	   WRITE LINEA FROM ENCABEZADO1-TRABAJO AFTER ADVANCING
	   2 LINES
	   WRITE LINEA FROM ENCABEZADO2-TRABAJO.
       500-PROCESO.
	   WRITE LINEA FROM LINEA-R
	   DISPLAY REGISTRO-S
	   PERFORM 550-LECTURA.
       550-LECTURA.
