       IDENTIFICATION DIVISION.
       PROGRAM-ID.PROGRAMA.
       AUTHOR.ZU¥IGA.

       ENVIRONMENT DIVISION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR PIC ZZZZZZZZ.
       01 VAR2 PIC 9999999.

       PROCEDURE DIVISION.
       DISPLAY ERASE.
       DISPLAY "hOLA MUNDO!" AT 1010.
       ACCEPT VAR AT 1515.
       STOP RUN.
