       IDENTIFICATION DIVISION.
       PROGRAM-ID.PRUEBA.
       AUTHOR.JOSE JUAN.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMERICOS.
	    02 NUM1 PIC ZZZZ.ZZ.
	    02 NUM2 PIC ZZZZ.ZZ.
	    02 SUMAF PIC ZZZZZ.ZZ.
	    02 RESTAF PIC ZZZZ.ZZ.
	    02 MULTIPLICACIONF PIC ZZZZZZZZ.ZZ.
	    02 DIVISIONF PIC ZZZZ.ZZZZ.
       01 VARIABLES.
	    02 NUMVAR1 PIC 9999V99 VALUE ZEROS.
	    02 NUMVAR2 PIC 9999V99 VALUE ZEROS.
	    02 SUMA PIC 99999V99 VALUE ZEROS.
	    02 RESTA PIC 9999V99 VALUE ZEROS.
	    02 MULTIPLICACION PIC 99999999V99 VALUE ZEROS.
	    02 DIV PIC 9999V9999 VALUE ZEROS.
       01 ALFABETICOS.
	    02 LETRA1 PIC X.

       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-PROCESO UNTIL LETRA1 = "N" OR "n"
       STOP RUN.

       100-PROCESO.
	    DISPLAY ERASE
	    DISPLAY "VALOR DE LA VARIABLE 1:" AT 1010
	    ACCEPT NUM1 AT 1110
	    DISPLAY "VALOR DE LA VARIABLE 2:" AT 1210
	    ACCEPT NUM2 AT 1310
	    PERFORM 20-MUEVEFORMATO
	    PERFORM 30-CALCULOS
	    PERFORM 40-REGRESAFORMATO
	    DISPLAY "LA SUMA DE LOS NUMEROS: " AT 1510
	    DISPLAY SUMAF AT 1545
	    DISPLAY "LA RESTA DE LOS NUMEROS: " AT 1610
	    DISPLAY RESTAF AT 1645
	    DISPLAY "EL PRODUCTO DE LOS NUMEROS: " AT 1710
	    DISPLAY MULTIPLICACIONF AT 1745
	    DISPLAY "LA DIVISION DE LOS NUMEROS: " AT 1810
	    DISPLAY DIVISIONF AT 1845
	    DISPLAY "¨DESEAS CONTINUAR?: " AT 2310
	    ACCEPT LETRA1 AT 2410.

       20-MUEVEFORMATO.
	    MOVE NUM1 TO NUMVAR1.
	    MOVE NUM2 TO NUMVAR2.

       30-CALCULOS.
	    COMPUTE SUMA = NUMVAR1 + NUMVAR2.
	    COMPUTE RESTA = NUMVAR1 - NUMVAR2.
	    COMPUTE MULTIPLICACION = NUMVAR1 * NUMVAR2.
	    COMPUTE DIV = NUMVAR1 / NUMVAR2.

       40-REGRESAFORMATO.
	    MOVE NUMVAR1 TO NUM1.
	    MOVE NUMVAR2 TO NUM2.
	    MOVE SUMA TO SUMAF.
	    MOVE RESTA TO RESTAF.
	    MOVE MULTIPLICACION TO MULTIPLICACIONF.
	    MOVE DIV TO DIVISIONF.
