      *COBOL UPIICSA

       IDENTIFICATION DIVISION.
       PROGRAM-ID.REMEMBER.
       AUTHOR.JJRZ.
       DATE-WRITTEN.01-01-99.
       DATE-COMPILED.01-01-99.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.PIII.
       OBJECT-COMPUTER.PIII.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMEROS.
	   03 NUM1 PIC 99999999V99 VALUE ZEROS.
	   03 NUM2 PIC 99999999V99 VALUE ZEROS.
	   03 RES PIC 9999999999V999 VALUE ZEROS.
       01 FORMATO.
	   03 NUM1F PIC ZZZZZZZZ.ZZ.
	   03 NUM2F PIC ZZZZZZZZ.ZZ.
	   03 RESF PIC Z(10).ZZ.
       01 OPCION.
	   03 OPC PIC X VALUE SPACES.

       PROCEDURE DIVISION.
	   DISPLAY ERASE.
	   DISPLAY "HOLA".
	   DISPLAY "DAME UN NUMERO: " AT 0505.
	   ACCEPT NUM1F AT 0605.
	   DISPLAY "DAME OTRO NUMERO: " AT 0805.
	   ACCEPT NUM2F AT 0905.
	   MOVE NUM1F TO NUM1.
	   MOVE NUM2F TO NUM2.
	   COMPUTE RES=NUM1+NUM2.
	   MOVE RES TO RESF.
	   DISPLAY RES AT 1105.
	   DISPLAY RESF AT 1305.
	   STOP RUN.
