       IDENTIFICATION DIVISION.
       PROGRAM-ID.FECHA.
       AUTHOR. ZU¥IGA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER.DX2.
       SOURCE-COMPUTER.DX2.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 OPC PIC 9 VALUE ZEROS.

       PROCEDURE DIVISION.
       000-INICIO.
	   DISPLAY ERASE.
	   PERFORM 100-ACEPTA UNTIL OPC=1 OR OPC=2
	   STOP RUN.

       100-ACEPTA.
	   MOVE ZEROS TO OPC
	   DISPLAY "1.HOMBRE" AT 0505
	   DISPLAY "2.MUJER" AT 0705
	   DISPLAY "ELIJA LA OPCION ADECUADA:" AT 0905
	   ACCEPT OPC AT 0933
	   IF OPC=1
	   THEN
	     DISPLAY "HOMBRE" AT 1105
	   ELSE
	    IF OPC=2
	    THEN
	      DISPLAY "MUJER" AT 1105
	    ELSE
	      DISPLAY "ERROR" AT 1105
	    END-IF
	   END-IF.
