      *JOSE JUAN REYES ZU付GA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.SUELDOS.
       AUTHOR.ZU付GA.
       DATE-WRITTEN.14-08-00.
       DATE-COMPILED.14-08-00.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VARS.
	   03 SUELDO PIC 99999V99.
	   03 RES PIC 99999V99.
       01 NUMS.
	   03 SUELDOE PIC $$$$$$.$$.
	   03 RESE PIC $$$$$$.$$.
       01 VARES.
	   03 CON PIC 99.
	   03 CO PIC 99.
       01 OPC PIC X.
       01 C PIC X.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-PROCESO UNTIL OPC="N" OR "n"
	   STOP RUN.

       100-PROCESO.
	   MOVE ZEROS TO VARS.
	   MOVE ZEROS TO NUMS.
	   PERFORM 050-MARCOS.
	   DISPLAY "DEME EL SUELDO DEL EMPLEADO:" AT 0810 WITH HIGHLIGHT.
	   ACCEPT SUELDOE AT 1010 WITH HIGHLIGHT.
	   MOVE SUELDOE TO SUELDO.
	   EVALUATE SUELDO
	   WHEN 0 THRU 9999
	     COMPUTE RES=SUELDO*1.12
	     MOVE RES TO RESE
	     DISPLAY "SU SUELDO PARCIAL ES:" AT 1210
	     DISPLAY SUELDOE AT 1410
	     DISPLAY "SU SUELDO NETO ES:" AT 1610
	     DISPLAY RESE AT 1810
	     DISPLAY "求ESEA HACER OTRO CALCULO?" AT 2010
	     ACCEPT OPC AT 2210
	   WHEN 10000 THRU 19999
	     COMPUTE RES=SUELDO*1.13
	     MOVE RES TO RESE
	     DISPLAY "SU SUELDO PARCIAL ES:" AT 1210
	     DISPLAY SUELDOE AT 1410
	     DISPLAY "SU SUELDO NETO ES:" AT 1610
	     DISPLAY RESE AT 1810
	     DISPLAY "求ESEA HACER OTRO CALCULO?" AT 2010
	     ACCEPT OPC AT 2210
	   WHEN 20000 THRU 29999
	     COMPUTE RES=SUELDO*1.14
	     MOVE RES TO RESE
	     DISPLAY "SU SUELDO PARCIAL ES:" AT 1210
	     DISPLAY SUELDOE AT 1410
	     DISPLAY "SU SUELDO NETO ES:" AT 1610
	     DISPLAY RESE AT 1810
	     DISPLAY "求ESEA HACER OTRO CALCULO?" AT 2010
	     ACCEPT OPC AT 2210
	   WHEN 30000 THRU 40000
	     COMPUTE RES=SUELDO*1.15
	     MOVE RES TO RESE
	     DISPLAY "SU SUELDO PARCIAL ES:" AT 1210
	     DISPLAY SUELDOE AT 1410
	     DISPLAY "SU SUELDO NETO ES:" AT 1610
	     DISPLAY RESE AT 1810
	     DISPLAY "求ESEA HACER OTRO CALCULO?" AT 2010
	     ACCEPT OPC AT 2210
	   WHEN OTHER
	     PERFORM 050-MARCOS
	     DISPLAY "NADIE AQUI GANA TANTO" AT 1210
	     DISPLAY "求ESEA HACER OTRO CALCULO?" AT 2010
	   ACCEPT OPC AT 2210
	   END-EVALUATE.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING CO FROM 1 BY 1 UNTIL CO>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING CO FROM 1 BY 1 UNTIL CO>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON WITH HIGHLIGHT
	   FOREGROUND-COLOR IS 6.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE CO COL 1 WITH HIGHLIGHT
	   FOREGROUND-COLOR IS 10.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON WITH HIGHLIGHT
	   FOREGROUND-COLOR IS 3.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE CO COL 78 WITH HIGHLIGHT
	   FOREGROUND-COLOR IS 7.
