       IDENTIFICATION DIVISION.
       PROGRAM-ID.SUMA.
      *ESTE PROGRAMA ACEPTA 5 NUMEROS
      *LOS DESPLIEGA LOS SUMA Y DESPLIEGA LA SUMA DE TODOS
       AUTHOR.AXA.
       DATE-WRITTEN.VERANO DEL 2000.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM.
       OBJECT-COMPUTER. IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X   PIC 9 VALUE ZEROS.
       01 Y   PIC 9 VALUE ZEROS.
       01 C   PIC 9 VALUE ZEROS.
       01 TOTAL	PIC 9 VALUE ZEROS.
       01 ARRE.
	 02 CAMPO OCCURS 5 TIMES.
	  03 DATO PIC 9.
       PROCEDURE DIVISION.
       001-RUTINA-PRINCIPAL.
       DISPLAY ERASE
       MOVE 10 TO C
       PERFORM 100-ACEPTA VARYING X FROM 1 BY 1 UNTIL X > 5
       MOVE 10 TO C
       PERFORM 200-DESP VARYING X FROM 1 BY 1 UNTIL X > 5
       DISPLAY "EL TOTAL ES" LINE 7 POSITION 10
       DISPLAY TOTAL LINE 7 POSITION 24
       ACCEPT Y
       STOP RUN.
       100-ACEPTA.
	   ACCEPT DATO (X) LINE 2 POSITION C
	   COMPUTE C = (C + 3).
       200-DESP.
	   COMPUTE TOTAL = TOTAL + dato ( X)
	   DISPLAY DATO (X) LINE 5 POSITION C
	   COMPUTE C = (C + 3).
