      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLAS.
       AUTHOR. ZU¥IGA.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VARS.
	   03 NUM1 PIC 99V99.
	   03 NUM2 PIC 99V99.
	   03 RES PIC 9999V99.
	   03 RESE PIC ZZZZ.ZZ.
	   03 NUM1E PIC ZZ.ZZ.
	   03 NUM2E PIC ZZ.ZZ.
	   03 CONTA PIC 99.
	   03 C PIC 9.
       01 OPC PIC X.
       01 VARES.
	   03 CON PIC 99.
	   03 CO PIC 99.
       PROCEDURE DIVISION.
       000-INICIO.
	   PERFORM 100-PROCESO UNTIL OPC="N" OR "n"
	   STOP RUN.

       100-PROCESO.
	   PERFORM 050-MARCOS.
	   MOVE ZEROS TO VARS.
	   MOVE 6 TO CONTA.
	   MOVE 1 TO C.
	   DISPLAY "TECLEE UN NUMERO Y APARECERA LA TABLA DE"
	   AT 0202 WITH HIGHLIGHT.
	   DISPLAY "MULTIPLICAR DE DICHO NUMERO HASTA LA TABLA 10"
	   AT 0302 WITH HIGHLIGHT.
	   ACCEPT NUM1E AT 0402 WITH HIGHLIGHT FOREGROUND-COLOR IS 7.
	   MOVE NUM1E TO NUM1.
	   PERFORM 200-DESPLIEGA VARYING NUM2 FROM 1 BY 1 UNTIL NUM2>10
	   DISPLAY "¨DESEA VER OTRA TABLA DE MULTIPLICAR? S/N" AT 2102.
	   ACCEPT OPC WITH HIGHLIGHT FOREGROUND-COLOR IS 9 AT 2202.

       200-DESPLIEGA.
	   COMPUTE RES=RES+NUM1.
	   MOVE RES TO RESE.
	   MOVE NUM1 TO NUM1E.
	   MOVE NUM2 TO NUM2E.
	   DISPLAY NUM1E LINE CONTA COL 4.
	   DISPLAY "*" LINE CONTA COL 9.
	   DISPLAY NUM2E LINE CONTA COL 11.
	   DISPLAY "=" LINE CONTA COL 13.
	   DISPLAY RESE LINE CONTA COL 15.
	   COMPUTE CONTA=CONTA+C.

       050-MARCOS.
	   DISPLAY ERASE
	   PERFORM 1000-DESPLIEGA VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 2000-DESPLIEGA2 VARYING CO FROM 1 BY 1 UNTIL CO>24.
	   MOVE ZEROS TO VARES.
	   PERFORM 3000-DESPLIEGA3 VARYING CON FROM 1 BY 1 UNTIL CON>78.
	   PERFORM 4000-DESPLIEGA4 VARYING CO FROM 1 BY 1 UNTIL CO>24.
       1000-DESPLIEGA.
	   DISPLAY "" LINE 1 COL CON WITH FOREGROUND-COLOR IS 2.
       2000-DESPLIEGA2.
	   DISPLAY "" LINE CO COL 1 WITH FOREGROUND-COLOR IS 9.
       3000-DESPLIEGA3.
	   DISPLAY "" LINE 24 COL CON WITH FOREGROUND-COLOR IS 14.
       4000-DESPLIEGA4.
	   DISPLAY "" LINE CO COL 78 WITH FOREGROUND-COLOR IS 13.
