      *JOSE JUAN REYES ZU¥IGA
       IDENTIFICATION DIVISION.
       PROGRAM-ID.TEMP.
       AUTHOR.ZU¥IGA.
       DATE-WRITTEN.14-08-00.
       DATE-COMPILED.14-08-00.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.IBM.
       OBJECT-COMPUTER.IBM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CAMPO OCCURS 12 TIMES.
	   03 DATO PIC 999.
	   03 DATOE PIC ZZZ.
       01 VARS.
	   03 I PIC 9.
	   03 X PIC 9.
	   03 Y PIC 9.
	   03 MAYOR PIC 999.
	   03 MENOR PIC 999.
	   03 PROM PIC 999.

       PROCEDURE DIVISION.
       000-PRINCIPAL.
	   MOVE ZEROS TO VARS.
	   DISPLAY ERASE.
	   PERFORM 100-ACEPTA VARYING I FROM 1 BY 1 UNTIL I>12
	   STOP RUN.

       100-ACEPTA.
	   ADD 2 TO X.
	   DISPLAY "INTRODUZCA LA TEMPERATURA NUMERO" LINE X COL 5.
	   DISPLAY I LINE X COL 37.
	   DISPLAY "¦C" LINE X COL 43.
	   ACCEPT DATOE(I) LINE X COL 39.
