       IDENTIFICATION DIVISION.
       PROGRAM-ID.VECTOR.
       AUTHOR.ULISES.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CAMPO OCCURS 5 TIMES.
	  03 DATO PIC 9.
       01 VARS.
	  03 CAS  PIC 99.
	  03 TOT  PIC 99.
	  03 A	  PIC 9.
	  03 TOTAL  PIC 99.

       PROCEDURE DIVISION.
       00-INICIO.
	  MOVE 10 TO CAS
	  PERFORM 01-ACEPTA  VARYING A FROM 1 BY 1 UNTIL A>5
	  DISPLAY "LA SUMA DE LOS 5 DIGITOS ES DE "  TOTAL
       STOP RUN.

       01-ACEPTA.
	  DISPLAY "TECLEE 5 NUMEROS ENTRE 0 Y 9" AT LINE 2 POSITION 10.
	  ACCEPT DATO(A) LINE 4 COL CAS.
	  COMPUTE CAS=CAS+3.
	  COMPUTE TOTAL=TOTAL + DATO(A).
