       IDENTIFICATION DIVISION.
       PROGRAM-ID.VECTOR2.
       AUTHOR. FERNANDO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. HP.
       OBJECT-COMPUTER. HP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 CAMPO OCCURS 12 TIMES.
	   03 TEMP PIC 99.

       01 VARS.
	   03 X      PIC 99.
	   03 Y      PIC 99.
	   03 PROM   PIC 99.99.
	   03 MEN    PIC 99.
	   03 MAY    PIC 99.
	   03 P      PIC 99.
	   03 TOT    PIC 999.


       PROCEDURE DIVISION.
       00-INICIO.
	  DISPLAY ERASE
	  CALL "MARCO"
	  MOVE ZEROS TO TOT
	  PERFORM 10-ACEPTA VARYING X FROM 1 BY 1 UNTIL X>12
	  COMPUTE MAY=TEMP(1)
	  COMPUTE MEN=TEMP(1)
	  PERFORM 20-COMPA VARYING X FROM 1 BY 1 UNTIL X>12
	  DISPLAY "LA SUMA DE LAS 12 TEMPERATURAS ES " AT 1815 TOT"低"
	  DISPLAY "LA PROMEDIO ES " AT 1915 P"低"
	  DISPLAY "LA MENOR ES " AT 2015 MEN"低"
	  DISPLAY "LA MAYOR ES " AT 2115 MAY"低"
	  CANCEL "MARCO"
	  STOP RUN.

       10-ACEPTA.
	  MOVE ZEROS TO Y
	  MOVE ZEROS TO P
	  COMPUTE Y = X + 4
	  DISPLAY "INTRODUCE LA TEMPERATURA     低 " LINE Y COL 15
	  DISPLAY  X LINE Y COL 38
	  ACCEPT TEMP(X) WITH SIZE 2 RIGTH-JUSTIFY AUTO
	   PROMPT LINE Y COL 41
	  COMPUTE TOT= TOT + (TEMP(X))
	  COMPUTE P=TOT/12.

	20-COMPA.


	   IF TEMP(X)>MAY
	       COMPUTE MAY=TEMP(X)

	   IF TEMP(X)<MEN
	       COMPUTE MEN=TEMP(X).
