       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "C:\COBOL\BIN\PROM\VER.wks".
       SCREEN SECTION.
       COPY "C:\COBOL\BIN\PROM\VER.ss".
       PROCEDURE DIVISION.
           DISPLAY G-VER.
           STOP RUN.
